export const data = [
  {
    skills: [
      {
        id: 0,
        name: "html",
      },
      {
        id: 1,
        name: "css",
      },
      {
        id: 2,
        name: "scss",
      },
      {
        id: 3,
        name: "javascript",
      },
      {
        id: 4,
        name: "react.js",
      },
      {
        id: 5,
        name: "next.js",
      },
      {
        id: 6,
        name: "figma",
      },
    ],
  },
  {
    education: [
      {
        id: 10,
        date: "2021 - 2022",
        school: "資展國際 - ",
        schooldes: "互動式網站UI/UX設計師就業養成班",
        des: "在進修課程期間學習到多方面的內容，從視覺設計原則、使用者體驗設計流程、學習如何使用設計工具如 Figma 和 Adobe AI 與 PS 進行介面設計，到前端開發技術 HTML、CSS 和 JavaScript 的使用、以及如何將這些元素整合到實際的專案中將設計轉換成具體的網站。",
      },
      {
        id: 11,
        date: "2019 - 2021",
        school: "國立台北教育大學 - ",
        schooldes: "數位科技學系玩具與遊戲設計研究所",
        des: "在研究所期間，我參與遊戲與玩具的設計流程。課程涵蓋了遊戲理論、互動設計和使用者體驗等領域，讓我了解如何創造引人入勝的遊戲環境和有趣的玩具。我參與了多個實作專案，包括我的碩論一款結合教育與娛樂的桌上遊戲，這不僅挑戰了我的創造力，還培養了我的項目管理能力。 ",
      },
      {
        id: 12,
        date: "2013 - 2017",
        school: "東南科技大學 - ",
        schooldes: "工業管理系",
        des: "在大學四年的工業管理科系學習中，我深刻理解了生產流程、品質管理和供應鏈優化等關鍵概念。課堂上，我積極參與小組專案，與同學合作解決實際案例，這不僅增強了我的團隊合作能力，也讓我學會了如何有效地溝通和分配任務。",
      },
    ],
  },
  {
    experience: [
      {
        id: 21,
        date: "2022 - 2023",
        f: "國立台北教育大學 - ",
        e: "研究助理",
        des: `工作內容：`,
        des1: "1. 課程協助：協助教授準備教學資料、課程內容以及教材。",
        des2: "2. 專題研究輔導：支持學生進行玩具設計或遊戲開發相關的專題研究，提供技術指導、意見回饋，並協助解決他們在設計與實作過程中遇到的問題。",
        des3: "3. 學術研究協助：協助教授進行玩具與遊戲設計領域的學術研究，整理文獻資料、進行數據分析，並參與相關的研討會或展示活動。",
        des4: "4. 3D列印機管理：負責操作和維護3D列印機，確保設備處於良好工作狀態，並協助學生進行3D模型列印。這包括處理列印機設定、材料準備及基本故障排除，確保學生的設計作品能順利轉化為實體模型。",
      },
    ],
  },
  {
    about:
      "畢業於台北教育大學數位系玩具與遊戲設計研究所。 研究所期間接觸到網頁相關設計課程，對此有了興趣，畢業後為了能更精進自己的技術，至資策會進修UIUX網頁設計。 在求學這段時間除了技術提升，更讓我能體會設計是要從問題本身去探討，才會是一個好的設計。 我的個性執著、有耐性，善於接受不同的意見以及新的知識並深入了解 。",
  },
];
